app/controllers/main_controller.rb

INSERT INTO "recipes" ("menu", "ingredient", "recipe", "country", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    recipe = Recipe.new
    recipe.menu = params[:menu]
    recipe.ingredient = params[:ingredient]
    recipe.recipe = params[:recipe]
    recipe.country = params[:country]
    recipe.rate = params[:rate]
    recipe.save