app/controllers/profile_controller.rb

  def profile

    @profiles = Profile.all
---
SELECT "profiles".* FROM "profiles"

  def create
    profile = Profile.new
    profile.username = params[:username]
    profile.usergender = params[:usergender]
    profile.country = params[:country]
    profile.preference = params[:preference]
    profile.useringredient = params[:useringredient]
    profile.save
---
INSERT INTO "profiles" ("username", "usergender", "country", "preference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "Sunkyeong"], ["usergender", "Female"], ["country", "Asia"], ["preference", "Sweet"], ["created_at", "2018-12-02 06:34:37.488208"], ["updated_at", "2018-12-02 06:34:37.488208"]]