app/controllers/recipes_controller.rb

    def index
      if params[:country]
        @recipes = Recipe.where(:country => params[:country])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."country" = ?  [["country", "North America"]]